<script setup lang="ts">
  import { definePageMeta } from '#imports'
  import { NCollapse, NCollapseItem, NStep, NSteps, NTimeline, NTimelineItem } from 'naive-ui'
  import { RoutesNames } from '~/services/routes-names'
  definePageMeta({
    layout: 'profile-layout',
    key: 'settings',
    middleware: 'auth'
  })
</script>

<template>
  <n-space vertical justify="center" class="">
    <h1 class="text-center text-xl md:text-7xl my-8">Правила конкурса Bikini Star</h1>
    <h3 class="text-center text-xl md:text-4xl">ДОСТУПНО О ВАЖНОМ</h3>
    <h2 class="text-center text-xl md:text-4xl my-12">Как стать участницей конкурса Bikini Star</h2>
    <n-space class="mt-8">
      <n-steps vertical :current="2" :status="'finish'">
        <n-step>
          <template #title>
            <div class="font-medium text-xl text-gray-800">
              Загрузить конкурсную фотографию
            </div></template
          >
          <div class="text-xl">+ дополнительно до 10 фото в бикини или купальнике - портфолио.</div>
        </n-step>
        <n-step
          title="Модерация"
          description="После проверки модератором вы станете участницей конкурса."
        >
          <template #title>
            <div class="font-medium text-xl text-gray-800">Модерация</div></template
          >
          <div class="text-xl">После проверки модератором вы станете участницей конкурса.</div>
        </n-step>
      </n-steps>
    </n-space>
    <n-space vertical size="large" class="mt-6 md:my-12 pb-12">
      <n-space vertical size="large">
        <div class="text-2xl font-bold">ГОЛОСОВАНИЕ</div>
        <p class="text-xl">
          Заканчивается в последний день месяца, в 22.00.00 Подсчет голосов (рейтинг) автоматически
          суммируются бесплатные голоса и дополнительные голоса от зарегистрированных пользователей.
          Если несколько работ, из числа призеров (первые три места), на момент фиксации результатов
          (22.00.00) набрало равное кол-во голосов, то объявляется дополнительное время и
          голосование проходит только по выбранным участницам.
        </p>
      </n-space>
      <n-space vertical size="large">
        <div class="text-2xl font-bold">ЗАПРЕЩЕНО</div>
        <p class="text-xl">
          Коллаж (монтаж), в том числе добавление, удаление, перемещение объектов, добавление
          дополнительных графических элементов, изменение фона средствами графических редакторов.
          Работы не должны иметь каких-либо авторских плашек, авторских знаков, добавленных рамок и
          т.д. ПОРНО и другое, нарушающее законодательство РФ.
        </p>
      </n-space>
      <n-space vertical size="large">
        <div class="text-2xl font-bold">РАЗРЕШЕНО</div>
        <p class="text-xl">
          Техническая ретушь, включая изменение экспозиции, контраста, насыщенности, резкости,
          перевод изображения в черно-белое и баланса белого. А так же коррекцию снимка с целью
          удалить случайно попавшие в кадр предметы. Кадрирование/кроп (без увеличение размеров
          снимка). Сканирование изображение полученных классическим химическим способом.
        </p>
      </n-space>
      <n-space vertical size="large">
        <div class="text-2xl font-bold">Авторская и интеллектуальная собственность</div>
        <p class="text-xl">
          Авторские права на представленную конкурсную работу должны полностью принадлежать
          участнице конкурса. Участвуя в конкурсе, участница даёт своё согласие организатору
          конкурса бесплатно использовать их для целей продвижения конкурса в различных СМИ, печати
          альбома, каталога с работами финалистов и лауреатов, а также на производство работ на
          выставку. Использовать работы финалистов в будущем для проведения специализированных
          мероприятий, посвященных популяризации конкурса с указаниям авторства работ. Загружая
          фотографию на Сайт, Участница автоматически подтверждает, что не нарушает авторских прав и
          иных интеллектуальных прав, и в полной мере несет за это ответственность.
        </p>
      </n-space>
      <n-space vertical size="large">
        <div class="text-2xl font-bold">
          Нарушение правил, пользовательского соглашения, правил сайта
        </div>
        <p class="text-xl">
          В случае нарушения правил конкурса или возникновения противоречий между Участницей и
          Организатором, или не согласием с текущими правилами и невозможностью найти решение,
          участие в конкурсе прекращается путем аннулирования участия и удалением всех фотографий с
          сайта. Аннулируется рейтинг. Обнуляется баланс "Дополнительный Голос" без бонусных выплат.
        </p>
      </n-space>
    </n-space>
    <div class="py-8 mt-8">
      <n-space vertical>
        <n-collapse>
          <n-collapse-item title="+1 голос пользователя" name="1">
            <div>
              любой авторизованный пользователь может дать бесплатно один голос одной участнице
            </div>
          </n-collapse-item>
          <n-collapse-item title="+ Дополнительный голос" name="2">
            <div>
              <p>
                Любой авторизованный пользователь может поднять рейтинг конкурсной работы, оплатив
                дополнительные баллы:
              </p>
              <p>
                +5 баллов (100 руб) <br />+15 баллов (300 руб) <br />+25 баллов (500 руб) <br />+50
                баллов (1000 руб)
              </p>
              <p>
                Выбрав желаемое кол-во баллов к рейтингу, оплатив, система моментально добавит баллы
                к рейтингу конкурсной работы. Участница может видеть в Личном кабинете (в разделе
                Статистика-Дополнительные баллы) кто и сколько добавил баллов. Отозвать
                дополнительные голоса не возможно.
              </p>
            </div>
          </n-collapse-item>
        </n-collapse>
      </n-space>
    </div>
    <div>
      <h2 class="text-gray-800 font-bold text-xl md:text-3xl">
        более подробная информация:
        <nuxt-link class="text-gray-800" :to="RoutesNames.STATIC_TERMS"
          >правила пользования</nuxt-link
        >
        сайтом Бикини Стар пользовательское
        <nuxt-link class="text-gray-800" :to="RoutesNames.STATIC_PRIVACY">соглашение</nuxt-link>
      </h2>
    </div>
  </n-space>
</template>

<style scoped>
  :deep(p) {
    @apply text-xl font-medium;
  }
</style>
