<script setup lang="ts">
  import { TheWrapper } from '#components'
  import { definePageMeta } from '#imports'
  definePageMeta({
    layout: 'profile-layout',
    key: 'settings',
    middleware: 'auth'
  })
</script>

<template>
  <h1 class="text-center text-xl md:text-4xl">Пользовательское соглашение</h1>

  <div class="mt-6 md:mt-12">
    <div>
      <h3 class="">1. Общие положения</h3>
      <p>
        1.1. Принимая во внимание, что Сайт БИКИНИ СТАР представляет собой платформу взаимодействия
        пользователей, Сервисов и специализированных инструментов, призванных повысить удобство
        использования привычных для пользователей Сервисов, ИП Измалин Павел Анатольевич (ОГРН
        322325600041770, адрес местонахождения: 241004 Брянск пер. Новозыбковский д 11 кв 30), далее
        именуемое также «Компания», «мы», «наше» или «нас», разработало и разместило настоящее
        Пользовательское соглашение (далее — настоящее Соглашение), которое применяется ко всем
        лицам, использующим любой из Сервисов Сайта БИКИНИ СТАР.<br />
        1.2. Настоящее Соглашение может быть изменено и/или дополнено Компанией в одностороннем
        порядке. Настоящее Соглашение является открытым и общедоступным документом. Действующая
        редакция настоящего Соглашения размещена по адресу: https://bikini-star.com/wiki/id.
        Компания рекомендует Пользователям регулярно проверять условия настоящего Соглашения на
        предмет его изменения и/или дополнения. Продолжение использования Сервисов и/или
        инструментов Пользователем после внесения изменений и/или дополнений в настоящее Соглашение
        означает принятие и согласие Пользователя с такими изменениями и/или дополнениями.<br />
        1.3. Отношения между Сторонами регулируются также Правилами защиты информации о
        Пользователях Сайта БИКИНИ СТАР которые размещены по адресу
        https://bikini-star.com/wiki/privacy, и Пользовательской документацией соответствующих
        Сервисов.
      </p>
    </div>
    <div>
      <h3>2. Предмет Соглашения</h3>
      <p>
        2.1. По условиям настоящего Соглашения Компания на безвозмездной основе предоставляет
        Пользователю следующие доступы, возможности и преимущества:<br />
        2.1.1. Управление регистрационными данными через личный кабинет единого аккаунта
        Пользователя;<br />
        2.1.2. Набор инструментов, функционально встраиваемых в Сервисы путём технической интеграции
        и позволяющих сделать повседневное использование привычных Сервисов максимально удобным для
        Пользователя и его данных, позволяющие получать своевременную и персонализированную
        информацию;<br />
        2.1.3. Возможность участвовать в бонусных программах;<br />
        2.2. Использование любого Сервиса БИКИНИ СТАР и/или её инструмента, как существующего на
        данный момент, так и того, который появится в будущем, условия использования которого
        ссылаются на настоящее Соглашение, означает в соответствии со ст. 438 Гражданского кодекса
        Российской Федерации принятие Пользователем условий настоящего Соглашения в полном объёме,
        без каких-либо оговорок и исключений. Использование любого Сервиса БИКИНИ СТАР и/или
        инструмента БИКИНИ СТАР, как существующего на данный момент, так и того, который будет
        создан в будущем, означает также принятие Пользователем условий отдельных пользовательских
        соглашений этих Сервисов БИКИНИ СТАР или инструментов БИКИНИ СТАР и их политик
        конфиденциальности (ранее и далее — Пользовательская документация Сервиса), являющихся
        неотъемлемой частью настоящего Соглашения, в полном объёме, без каких-либо оговорок и
        исключений. С перечнем Сервисов БИКИНИ СТАР можно ознакомиться здесь:
        https://bikini-star.com/wiki/services<br />
        2.3. Компания и Сервисы вправе устанавливать ограничения по использованию Сервисов и
        инструментов БИКИНИ СТАР, которые могут содержаться в настоящем Соглашении и/или
        Пользовательской документации отдельных Сервисов.
      </p>
    </div>
    <div>
      <h3>3. Создание аккаунта в БИКИНИ СТАР</h3>
      <p>
        3.1. Для предоставления функциональных возможностей Сайта БИКИНИ СТАР Пользователю создается
        аккаунт. <br />3.2. Такой аккаунт создается при регистрации на Cайте БИКИНИ СТАР
        (https://bikini-star.com).<br />
        3.3. Создание аккаунта на Cайте БИКИНИ СТАР является бесплатным и осуществляется путём
        заполнения регистрационной формы на сайте в сети Интернет по адресу
        https://bikini-star.com.<br />
        3.4. Пользователем Cайта БИКИНИ СТАР является физическое лицо, зарегистрированное в
        соответствии с установленным настоящим Соглашением порядком, достигшее возраста 18 лет,
        допустимого в соответствии с законодательством Российской Федерации для акцепта настоящего
        Соглашения, и обладающее соответствующими полномочиями.<br />
        3.5. В случае самостоятельной регистрации, в процессе заполнения регистрационной формы в
        соответствии с п. 3.2 на сайте в сети Интернет по адресу https://bikini-star.com
        Пользователь указывает обязательные актуальные достоверные данные, минимально необходимые
        для регистрации, включая фамилию, имя, дату рождения, пол, номер мобильного телефона.
        Отдельные Сервисы могут запрашивать у Пользователя меньшую информацию с обязательным
        последующим дозаполнением такого неполного аккаунта необходимыми данными. <br />3.6.
        Пользователь несёт ответственность за достоверность, актуальность, полноту и соответствие
        законодательству Российской Федерации информации, предоставленной при создании аккаунта и её
        чистоту от претензий третьих лиц. Компания не проверяет достоверность предоставленной
        Пользователями информации, за исключением случаев, когда такая проверка необходима в целях
        исполнения Компанией обязательств перед Пользователями. <br />3.7. В случае самостоятельной
        регистрации после предоставления необходимой для регистрации информации Пользователю
        необходимо пройти ряд удостоверительных действующих процедур и подтвердить регистрацию путем
        введения в соответствующую форму или на сайте полученного Пользователем в виде SMS-сообщения
        / звонка-сброса / звонка от робота или push-уведомления от Компании на мобильный телефон
        Пользователя, номер которого предоставляется самим Пользователем. В случае верного
        последовательного выполнения всех регистрационных действий создаётся аккаунт. <br />3.8.
        После успешного создания аккаунта Пользователя Компания принимает на себя права и
        обязанности перед Пользователем, указанные в настоящем Соглашении.<br />
        3.9. В целях исполнения настоящего Соглашения, а также Пользовательской документации
        Сервисов, пользователем которых является Пользователь настоящего Соглашения, в том числе в
        целях развития сайта, Сервисов и инструментов, разработки и внедрения новых инструментов
        и/или Сервисов, оптимизации качества инструментов и/или Сервисов, совершенствования
        доступной функциональности сайта с целью предоставления пользователям персонализированных
        функций, Пользователь соглашается и поручает Компании осуществить в полном соответствии с
        действующим законодательством Российской Федерации о персональных данных сбор, передачу и
        получение данных, в том числе необходимых для регистрации, и/или авторизации в конкретном
        Сервисе, и/или использования функциональных возможностей инструмента, в том числе для
        создания и поддержания аккаунта, для последующих сбора, хранения, накопления,
        систематизации, извлечения, сопоставления, использования, наполнения таких данных Сервисами,
        а также на получение таких данных от Сервисов, осуществление сбора и обработки, результатов
        автоматизированной обработки таких данных, в том числе с применением различных моделей
        оценки информации в виде целочисленных и/или текстовых значений и идентификаторов,
        соответствующих заданным в запросах оценочным критериям для обработки данных Компанией и/или
        Сервисами. <br />3.10. Обработка персональных данных Пользователя Сайта БИКИНИ СТАР
        осуществляется в соответствии с законодательством Российской Федерации. Компания принимает
        все необходимые меры для защиты персональных данных Пользователя от неправомерного доступа,
        изменения, раскрытия или уничтожения. Компания предоставляет доступ к персональным данным
        Пользователя только тем работникам, подрядчикам и агентам Компании, которым эта информация
        необходима для обеспечения функционирования и предоставления Пользователю доступа к
        использованию Сервисов и их функциональности. Компания вправе использовать предоставленную
        Пользователем информацию, в том числе персональные данные, а также передавать её третьим
        лицам в целях обеспечения соблюдения требований действующего законодательства Российской
        Федерации, защиты прав и интересов Пользователей Сайта, Компании, третьих лиц (в том числе в
        целях выявления, проверки/расследования и/или пресечения противоправных действий). Раскрытие
        предоставленной Пользователем информации может быть произведено лишь в соответствии с
        действующим законодательством Российской Федерации по требованию суда, правоохранительных
        органов, а равно в иных предусмотренных законодательством Российской Федерации случаях.
        Поскольку Компания осуществляет обработку персональных данных Пользователя в целях
        исполнения настоящего Соглашения, в силу положений законодательства о персональных данных
        согласие Пользователя на обработку его персональных данных не требуется. <br />3.11. Для
        подключения Сервиса и/или использования инструментов партнерских сервисов, соглашается с
        условиями настоящего Соглашения, относящимся к Партнёрам.<br />
        3.12. Партнёр обязуется обеспечить информационное и технологическое взаимодействие с
        Компанией в целях подключения и поддержания Сервиса Партнёра в составе Сайта БИКИНИ СТАР
        и/или использования инструментов, в том числе обмен информацией, которая необходима для
        взаимодействия Сервиса Партнёра с Сайтом БИКИНИ СТАР. <br />3.13. Сервисы обязуются
        осуществлять обработку полученных от Сайта БИКИНИ СТАР данных в полном соответствии с
        действующим законодательством Российской Федерации, в том числе законодательством о
        персональных данных, и самостоятельно несут ответственность в случае несоблюдения данного
        обязательства.<br />
        3.14. Пользователь Сайта БИКИНИ СТАР не имеет права предоставлять доступ к своему аккаунту
        иным лицам, несёт полную ответственность за сохранность данных, необходимых для авторизации,
        самостоятельно выбирая способ их хранения. Пользователь на используемом им
        аппаратно-программном обеспечении может разрешить хранение данных для последующей
        автоматической авторизации на Сайте БИКИНИ СТАР или Сервисе. <br />3.15. Если Пользователем
        не доказано обратное, любые действия, совершённые посредством его аккаунтана Сайте БИКИНИ
        СТАР, считаются совершёнными соответствующим Пользователем. В случае несанкционированного
        доступа к аккаунту Пользователь обязан незамедлительно сообщить об этом Компании в
        установленном порядке.
      </p>
    </div>
    <div>
      <h3>4. Права и обязанности Пользователя</h3>
      <p>
        4.1. При использовании Сервисов и инструментов Сайта БИКИНИ СТАР Пользователь обязан:
        <br />4.1.1. соблюдать положения действующего законодательства Российской Федерации,
        настоящего Соглашения и Пользовательской документации тех Сервисов, в которых он
        зарегистрирован; <br />4.1.2. предоставлять при создании аккаунта достоверные, полные и
        актуальные данные, следить за их актуализацией; <br />4.1.3. информировать Компанию о
        несанкционированном доступе к аккаунту Сайта БИКИНИ СТАР;<br />
        4.1.4. не предоставлять доступ другим лицам к своему аккаунту или к отдельной содержащейся в
        нем информации, в случае если это может привести к нарушению законодательства Российской
        Федерации, и/или настоящего Соглашения, и/или Пользовательской документации Сервисов;<br />
        4.1.5. осуществлять резервное копирование важной для Пользователя информации, хранящейся на
        Сайте БИКИНИ СТАР и/или Сервисах.<br />
        4.2. Пользователю Сайта БИКИНИ СТАР запрещается: <br />4.2.1. создавать аккаунт в качестве
        Пользователя от имени или вместо другого лица («фальшивый аккаунт»); <br />4.2.2. искажать
        сведения о себе;<br />
        4.2.3. использовать программное обеспечение и осуществлять действия, направленные на
        нарушение нормального функционирования Сайта БИКИНИ СТАР, и/или Сервисов, и/или её
        инструментов;<br />
        4.2.4. загружать, хранить, публиковать, распространять и предоставлять доступ или иным
        образом использовать вирусы, трояны и другие вредоносные программы;<br />
        4.2.5. любым способом, в том числе, но не ограничиваясь, путём обмана, злоупотребления
        доверием, взлома, пытаться получить доступ к аккаунту другого Пользователя.
        <br />4.3.Пользователь Сайта БИКИНИ СТАР имеет право:<br />
        4.3.1. подать запрос на удаление аккаунта на Сайте БИКИНИ СТАР в сообщении модератору или
        через форму обратной связи, что означает отказ Пользователя от использования всех Сервисов
        Сайта БИКИНИ СТАР, в которых Пользователь был зарегистрирован; <br />4.3.2. самостоятельно
        или через запрос модератору, отключить любой Сервис, что означает отказ Пользователя от
        использования такого Сервиса, и всех предоставленнных ему ранее в связи с использованием
        данного Сервиса прав. <br />4.4. В случае несогласия Пользователя с настоящим Соглашением,
        его изменениями и дополнениями, Пользователь обязан отказаться от использования Сервисов
        Сайта БИКИНИ СТАР и инструментов, проинформировав об этом Компанию в установленном порядке.
        <br />4.5. В случае несогласия Пользователя с Пользовательской документацией отдельного
        Сервиса, их изменениями и дополнениями Пользователь обязан отказаться от использования
        инструментов ЭСайта БИКИНИ СТАР применительно к такому Сервису (отключить Сервис) в порядке,
        предусмотренном п. 4.3.2. настоящего Соглашения.
      </p>
    </div>
    <div>
      <h3>Права и обязанности Компании</h3>
      <p>
        5.1. Компания осуществляет текущее управление и развитие Сайта БИКИНИ СТАР, разрешает или
        ограничивает доступ Пользователей к Сервисам Сайта БИКИНИ СТАР и инструментам, при нарушении
        такими лицами положений настоящего Соглашения осуществляет иные принадлежащие ей права.
        <br />5.2. Компания вправе без возмещения каких-либо затрат или убытков Пользователю
        заблокировать/удалить аккаунт Пользователя и/или приостановить, ограничить или прекратить
        доступ Пользователя к любому из Сервисов или инструментов.<br />5.3. Компания вправе:
        <br />5.3.1. оказывать в разумные сроки техническую и информационную поддержку Пользователя,
        необходимую для работы с Сайтом БИКИНИ СТАР; <br />5.3.2. осуществлять прямые контакты с
        Пользователем с помощью средств связи (по телефону, электронной почте или иными способами, в
        том числе с использованием имеющейся функциональности) в целях получения от Пользователя
        информации/комментариев о возникших проблемах/вопросах при использовании Сервисов и/или её
        инструментов, необходимых для устранения ошибок в работе и/или её инструментов и их
        дальнейшего развития/совершенствования;<br />
        5.3.3. приостанавливать предоставление доступа к Сервисам Сайта БИКИНИ СТАР и/или
        инструментам без предварительного уведомления Пользователей в случае необходимости
        проведения профилактических работ в Сервисах и/или инструментах в случае наступления
        форс-мажорных обстоятельств, а также аварий или сбоев в программно-аппаратных комплексах
        третьих лиц или действий третьих лиц, направленных на приостановку или прекращение
        функционирования всех или части Сервисов. <br />5.4. При исполнении настоящего соглашения
        Компания в своей деятельности руководствуется требованиями применимого законодательства, в
        том числе Федерального закона Российской Федерации от 27 июля 2006 года № 149-ФЗ «Об
        информации, информационных технологиях и о защите информации».
      </p>
    </div>
    <div>
      <h3>6. Прекращение действия аккаунта пользователя</h3>
      <p>
        6.1. Компания не несёт ответственности за нарушение Пользователем настоящего Соглашения и
        оставляет за собой право по своему собственному усмотрению, а также при получении информации
        от других пользователей либо третьих лиц о нарушении Пользователем настоящего Соглашения
        заблокировать/удалить аккаунт Пользователя на Сайте БИКИНИ СТАР и/или таким образом
        приостановить, ограничить или прекратить доступ Пользователя к любому из Сервисов и/или её
        инструменту в любое время по любой причине или без объяснения причин, с предварительным
        уведомлением или без такового. Приостановление, ограничение или прекращение доступа
        Пользователя к Сервисам Сайта БИКИНИ СТАР и/или инструменту, может повлечь за собой
        невозможность использования Сервисов, а также привести к удалению информации Пользователя, в
        том числе содержащейся в Сервисах.<br />
        6.2. В частности Компания может реализовать перечисленные в п. 6.1. права по следующим
        причинам:<br />
        6.2.1. если Компания обнаружит в действиях Пользователя признаки нарушения условий
        настоящего Соглашения или Пользовательской документации отдельных Сервисов, в которых
        Пользователь был зарегистрирован; 6.2.2. по соответствующему требованию органов власти и
        суда, если соблюдены все требования законодательства Российской Федерации;<br />
        6.2.3. из-за создания помех и любых нарушений в отношении Сервисов Сайта БИКИНИ СТАР и/или
        инструментов, включая использование любых устройств, программного обеспечения и т. п.
      </p>
    </div>
    <div>
      <h3>7. Гарантии и ответственность</h3>
      <p>
        7.1. Пользователи Сайта БИКИНИ СТАР несут ответственность перед Компанией за соблюдение
        условий настоящего Соглашения. <br />7.2. Сервисы и инструменты Сайта БИКИНИ СТАР
        предоставляются на условиях «как есть» (as is). Компания не предоставляет никаких гарантий в
        отношении безошибочной и бесперебойной работы Сервисов и/или инструментов, соответствия
        Сервисов и инструментов каким-либо целям и ожиданиям Пользователя, а также не предоставляет
        никаких иных гарантий, прямо не указанных в настоящем Соглашении.<br />
        7.3. Компания не принимает участия в оказании Сервисами услуг и/или предоставлении ими прав
        использования таких Сервисов Пользователям.<br />
        7.4. Компания не принимает на себя никаких обязательств и не несёт никакой ответственности
        за какие-либо прямые или косвенные последствия какого-либо использования или невозможности
        использования Сервисов и/или инструментов, в том числе в результате утраты Пользователем
        доступа к аккаунту и/или учетным записям Сервисов, и/или ущерб, причинённый Пользователю
        и/или третьим сторонам в результате какого-либо использования, неиспользования или
        невозможности использования Сервисов и/или инструментов, в том числе из-за временной или
        постоянной утраты доступа к аккаунту по любой причине, возможных ошибок или сбоев в работе
        Сервисов и инструментов, за исключением случаев, прямо предусмотренных законодательством
        Российской Федерации.<br />
        7.5. Компания обеспечивает функционирование и работоспособность инструмента и обязуется
        оперативно восстанавливать его работоспособность в случае технических сбоев и перерывов.
        Компания не несёт ответственности за временные сбои и перерывы в работе Сайта БИКИНИ СТАР и
        вызванные ими потери информации.<br />
        7.6. Никакие положения настоящего Соглашения не предоставляют Пользователю право на
        использование фирменного наименования, товарных знаков, доменных имён и иных отличительных
        знаков Компании. Компания имеет право распоряжаться статистической информацией, связанной с
        функционированием Сайта БИКИНИ СТАР, а также информацией Пользователей для обеспечения
        адресного показа рекламной информации различным аудиториям Пользователей и/или Сервисов. Для
        целей организации функционирования и технической поддержки Сайта БИКИНИ СТАР и исполнения
        настоящего Соглашения Компания имеет техническую возможность доступа к аккаунтам, которую
        реализует только в случаях, установленных настоящим Соглашением. <br />7.7. Сервисы Сайта
        БИКИНИ СТАР и инструменты имеют право направлять Пользователю информацию о развитии Сервисов
        и инструментов, их функциональности, а также рекламировать собственную деятельность.
        Пользователь соглашается на получение посредством Сервисов и инструментов электронных
        сообщений, SMS и иных видов рассылок информационного, в том числе рекламно-информационного,
        содержания.
      </p>
    </div>
    <div>
      <h3>8. Заключительные положения</h3>
      <p>
        8.1. Признание судом какого-либо положения настоящего Соглашения недействительным, или не
        подлежащим принудительному исполнению, не влечёт недействительности или неисполнимости иных
        положений настоящего Соглашения.<br />
        8.2. Настоящее Соглашение регулируется и толкуется в соответствии с законодательством
        Российской Федерации. Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению
        в соответствии с законодательством Российской Федерации. <br />
        8.3. Все споры сторон по настоящему Соглашению подлежат разрешению путём переписки и
        переговоров с использованием обязательного досудебного (претензионного) порядка. <br />8.4.
        Обращения, предложения и претензии физических и юридических лиц к Компании в связи с
        настоящим Соглашением и всеми вопросами по функционированию Сайта БИКИНИ СТАР, нарушениями
        прав и интересов третьих лиц при его использовании, а также для запросов уполномоченных
        законодательством Российской Федерации лиц могут быть направлены на почтовый адрес указанный
        в п. 1.1. настоящего Соглашения.
      </p>
    </div>
  </div>
  <div class="text-center text-2xl font-medium">Редакция от 15 января 2023 года</div>
</template>

<style scoped lang="scss">
  :deep(p) {
    @apply text-2xl py-3;
  }
  :deep(h3) {
    @apply font-medium text-xl md:text-3xl;
  }
</style>
